# HasNoConnections Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..HasNoConnections Method
FabricationPart Class See Also
---
Checks to see if all the fabrication part's connectors are open.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool HasNoConnections()
```

Visual Basic
---
```text
Public Function HasNoConnections As Boolean
```

Visual C++
---
```text
public:
bool HasNoConnections()
```

# ### Return Value
Returns true if the part has zero connections.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace